Revit 2026 API

# IFCExportOptionsFileVersion Property

---

IFC file version.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCVersion FileVersion { get; set; }
```
```vb
Public Property FileVersion As IFCVersion
	Get
	Set
```
```cpp
public:
property IFCVersion FileVersion {
	IFCVersion get ();
	void set (IFCVersion value);
}
```
```fsharp
member FileVersion : IFCVersion with get, set
```

#### Property Value

IFCVersion

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Default is IFCVersion.Default.

#### Reference

IFCExportOptions Class

Autodesk.Revit.DB Namespace